using System;
using System.Collections;
using System.Collections.Generic;
using System.Drawing;
using System.Drawing.Drawing2D;
using System.IO;
using System.Linq;
using System.Security.Cryptography;
using System.Text.RegularExpressions;
using Cetera.Font;
using game_digimon_re_digitize_decode.Properties;
using Kontract.Compression;
using Kontract.Interface;

namespace game_digimon_re_digitize_decode
{
    public class Handler : IGameHandler
    {
        #region Properties

        // Information
        public string Name => "Digimon Re:digitize Decode";
        public Image Icon => Resources.icon;

        // Feature Support
        public bool HandlerHasSettings => true;
        public bool HandlerCanGeneratePreviews => true;

        #endregion

        Dictionary<string, string> _pairs = new Dictionary<string, string>
        {
            // Commands
            ["<sel>"] = "\xE\x1\x6\x2",
            ["<unkcmd1>"] = "\xE\x1\x10\x0",
            ["<unkcmd2>"] = "\xE\x1\xC\x0",
            ["<unkcmd3>"] = "\xE\x1\xD\x0",
            ["<unkcmd4>"] = "\xE\x1\xE\x0",
            ["<shake>"] = "\xE\x1\xF\x0",
            ["<pause1>"] = "\xE\x1\x7\x2",
            ["<pause2>"] = "\xE\x1\x8\x2",
            ["<size>"] = "\xE\x0\x2\x2",
            ["<instant>"] = "\xE\x1\xE\x0",
            ["<padding>"] = "\xE\x1\x11\x4",

            // Color
            ["<c-blue>"] = "\xE\x0\x3\x2\x9\x0",
            ["<c-red>"] = "\xE\x0\x3\x2\xA\x0",
            ["<c-cyan>"] = "\xE\x0\x3\x2\xB\x0",
            ["<c-default>"] = "\xE\x0\x3\x2\xFF\xFF",

            // Variables
            ["<player>"] = "\xE\x1\x0\x0",
            ["<unkvar1>"] = "\xE\x1\x2",
            ["<unkvar2>"] = "\xE\x1\x3",
            ["<unkvar3>"] = "\xE\x1\x4",
            ["<unkvar4>"] = "\xE\x1\xA",
            ["<npc>"] = "\xE\x2\x0\x2",
            ["<map>"] = "\xE\x2\x1\x4",
            ["<item>"] = "\xE\x2\x2\x4",
            ["<value>"] = "\xE\x1\x5\x6",

            // Special
            ["Ⓐ"] = "\xE000",
            ["Ⓑ"] = "\xE001",
            ["Ⓧ"] = "\xE002",
            ["Ⓨ"] = "\xE003",
            ["🄻"] = "\xE004",
            ["🅁"] = "\xE005",
            ["✚"] = "\xE006",
            ["◀"] = "\xE036",
            ["▶"] = "\xE037",
            [":ravio:"] = "\xE05E",
            [":bow:"] = "\xE06C",
            [":bomb:"] = "\xE06D",
            [":rod:"] = "\xE06E",
            ["←"] = "\x2190",
            ["↑"] = "\x2191",
            ["→"] = "\x2192",
            ["↓"] = "\x2193"
        };

        static Lazy<BCFNT> fontInitializer = new Lazy<BCFNT>(() => new BCFNT(new MemoryStream(Resources.MainFont_bcfnt)));
        BCFNT font => fontInitializer.Value;

        string[] it_name = Resources.item.Split('\n');
        string[] loc_name = Resources.location.Split('\n');
        string[] npc_name = Resources.npc.Split('\n');

        public string GetKuriimuString(string rawString)
        {
            return _pairs.Aggregate(rawString, (str, pair) => str.Replace(pair.Value, pair.Key));
        }

        public string GetRawString(string kuriimuString)
        {
            return _pairs.Aggregate(kuriimuString, (str, pair) => str.Replace(pair.Key, pair.Value));
        }

        Bitmap background = new Bitmap(Resources.background);
        Bitmap textBox = new Bitmap(Resources.textbox);
        Bitmap textBoxUpFull = new Bitmap(Resources.INFOFULLUS);

        private string GetBetweenStr(string str, string str1, string str2)
        {
            int i1 = str.IndexOf(str1);
            if (i1 < 0) 
            {
                return "";
            }

            int i2 = str.IndexOf(str2, i1 + str1.Length);
            if (i2 < 0) 
            {
                return "";
            }

            return str.Substring(i1 + str1.Length, i2 - i1 - str1.Length);
        }

        // Previewer
        public IList<Bitmap> GeneratePreviews(TextEntry entry)
        {



            var pages = new List<Bitmap>();
            if (entry?.EditedText == null) return pages;

            string rawString = GetKuriimuString(entry.EditedText);
            string whoSay = GetBetweenStr(entry.Name,"By:"," Text:");
            var pagestr = new List<string>();
            int curline = 0;
            string curstr = "";

            int hanh = 6;
            int hangh = 5;

            

            if (Properties.Settings.Default.PlayerName.Contains("UPS"))
            {
                hanh = 6;
                hangh = 5;
                //rawString = rawString.Replace("<p>", "");
            }
            else
            {
                hanh = 2;
                hangh = 1;
                //rawString = rawString.Replace("<p>\\n", "\\n").Replace("<p>", "\\n");
            }

            List<string> list = rawString.Replace("<x0>","{变量零}").Replace("<x1>","{变量壹}").Replace("<x2>", "{变量贰}").Replace("<x3>", "{变量叁}").Replace("<x4>", "{变量肆}").Replace("<p>\\n", "<pn>\uEA47").Replace("\\n", "\uEA47").Split('\uEA47').ToList();
            bool pss = false;
            int oi = 0;
                for (int i = 0; i < list.Count; i++)
            {
                curstr += list[i];
                if (list[i].Contains("<p>"))
                {
                    pagestr.Add(curstr.Replace("<p>", ""));
                    oi++;
                    curstr = "";
                }
                else if(list[i].Contains("<pn>"))
                {
                    pagestr.Add(curstr.Replace("<pn>", ""));
                    pss = true;
                    if (i % hanh != hangh)
                    {
                        oi++;
                    }
                    curstr = "";
                }
                else if((i-oi) % hanh == hangh)
                {
                    pagestr.Add(curstr);
                    curstr = "";
                }

                else
                {
                    if (pss) {
                        pss = false;
                        curstr += "\\n";
                    }
                    else
                    {
                        curstr += "\\n";
                    }
                }
            }

            pagestr.Add(curstr);
            //curstr += rawString;


            foreach (string page in pagestr)
            {
                string p = GetRawString(page).Replace("<n1001>", Properties.Settings.Default.PlayerName == string.Empty ? "Player" : Properties.Settings.Default.PlayerName.Replace("UPS",""));

                if (p.Trim() != string.Empty)
                {
                    Bitmap img = new Bitmap(700, 440);

                    using (Graphics gfx = Graphics.FromImage(img))
                    {
                        gfx.SmoothingMode = SmoothingMode.HighQuality;
                        gfx.InterpolationMode = InterpolationMode.Bicubic;
                        gfx.PixelOffsetMode = PixelOffsetMode.HighQuality;

                        float x = 0, y = 0, z = 0;
                        float scale = 1.65f;
                        bool ups = false;

                        if (Properties.Settings.Default.PlayerName.Contains("UPS"))
                        {
                            gfx.DrawImage(textBoxUpFull, 0, 0, 700, 440);
                            x = 106;
                            y = 124;
                            ups = true;
                            z = 2.2f;
                            scale = 1.43f;
                        }
                        else
                        {
                            gfx.DrawImage(background, 0, 0);

                            gfx.DrawImage(textBox, 61, 350 - textBox.Height, 566, 146);
                            x = 85;
                            y = 420 - textBox.Height - 17;
                            z = 6;
                            scale = 1.65f;
                            ups = false;
                        }

                        // Text
                        Rectangle rectText = new Rectangle(32, 20, 336, 44);

                        bool cmd = false;
                        string param = "", temp = "";
                        int skip = 0, j = 0, padding = 0;

                        font.SetColor(Color.FromArgb(255, 255, 255, 255));
                        gfx.InterpolationMode = InterpolationMode.Bicubic;
                        
                        string p2 = whoSay;
                        if (nameDic.ContainsKey(whoSay))
                        {
                            string charName = nameDic[whoSay];
                            p2 = charName;
                        }

                        float x2 = 470;

                        int tm = 0;
                        int yp = 0;
                        bool min_lin = false;
                        bool name_replace = false;
                        bool dic = false;
                        bool wit = false;
                        string replacing = "";
                        foreach (char c in p)
                        {
                            if (min_lin)
                            {
                                if(c == 'n')
                                {
                                    yp += ups ? 42 : 46;
                                    x = ups ? 106 : 85;
                                    tm = 0;

                                }
                                min_lin = false;
                            }else if (name_replace)
                            {
                                if(c == 'n')
                                {
                                    dic = true;
                                }
                                else if (c == 'w')
                                {
                                    wit = true;
                                }
                                //else if (c == 'p')
                                //{
                                //   yp += ups ? 42 : 46;
                                //    yp += ups ? 42 : 46;
                                //    x = ups ? 106 : 85;
                                //    tm = 0;
                                //    pp = true;
                                //}
                                else if (c == '>' || replacing == "<n")
                                {
                                    if (!wit)
                                    {
                                        string replaced;
                                        if (nameDic.ContainsKey(replacing))
                                        {
                                            replaced = nameDic[replacing];
                                        }
                                        else
                                        {
                                            replaced = "<n" + replacing + ">";
                                        }
                                        foreach (char c2 in replaced)
                                        {
                                            font.SetColor(Color.Cyan);
                                            font.Draw(c2, gfx, tm * z + x, y + yp, scale, scale);
                                            x += font.GetWidthInfo(c2).char_width * scale;
                                            tm++;
                                            font.SetColor(Color.White);
                                        }
                                        replaced = "";
                                    }
                                    else
                                    {
                                        float xu = x;
                                        if (Regex.IsMatch(replacing, @"^\d+$"))
                                        {
                                            replacing = "(等待" + int.Parse(replacing) / 100 + ")";
                                        }
                                        else
                                        {
                                            replacing = "(等待：出错)";
                                        }
                                        foreach (char c3 in replacing)
                                        {
                                            font.SetColor(Color.Green);
                                            font.Draw(c3, gfx, tm * z + xu, y + yp - 11.5f, 1.2f, 1.2f);
                                            xu += font.GetWidthInfo(c3).char_width * 0.6f;
                                            tm++;
                                            font.SetColor(Color.White);
                                        }
                                    }
                                    replacing = "";
                                    dic = false;
                                    wit = false;
                                    name_replace = false;

                                }

                                else
                                {
                                    replacing += c;
                                }
                                if (!dic && !wit)
                                {
                                    //replacing = "<n";
                                    name_replace = false;
                                    if (c != '>')
                                    {
                                        font.Draw(c, gfx, tm * z + x, y + yp, scale, scale);
                                        x += font.GetWidthInfo(c).char_width * scale;
                                    }
                                }
                            }

                            else
                            {
                                if (c == '\\')
                                {
                                    min_lin = true;
                                }
                                else if (c == '<')
                                {
                                    name_replace = true;
                                }
                                else
                                {
                                    font.Draw(c, gfx, tm * z + x, y + yp, scale, scale);
                                    x += font.GetWidthInfo(c).char_width * scale;
                                    tm++;
                                }
                            }
                        }
                        int t2m = 0;
                        foreach (char c in p2)
                        {
                            font.Draw(c, gfx, t2m*3+ x2, y - 52, 1.5f, 1.5f);
                            x2 += font.GetWidthInfo(c).char_width * scale;
                            t2m++;
                        }
                    }

                    pages.Add(img);
                }
            }

            return pages;
        }

        public bool ShowSettings(Icon icon)
        {
            var settings = new Settings(icon);
            settings.ShowDialog();
            return settings.HasChanges;
        }


        public Dictionary<string, string> nameDic= new Dictionary<string, string>

        {
            ["0"] = "未知",
            ["1"] = "多多兽",
            ["2"] = "黑球兽",
            ["3"] = "沙砾兽",
            ["4"] = "浮球兽",
            ["5"] = "浮游兽",
            ["6"] = "汪喵兽",
            ["7"] = "滚球兽",
            ["8"] = "基基兽",
            ["9"] = "花蕾兽",
            ["10"] = "迪哥兽",
            ["11"] = "齿轮兽",
            ["12"] = "蜡烛兽",
            ["13"] = "吱吱兽",
            ["14"] = "使魔兽",
            ["15"] = "亚古兽",
            ["16"] = "乌龟兽",
            ["17"] = "管狐兽",
            ["18"] = "加奥兽",
            ["19"] = "拉拉兽",
            ["20"] = "小妖兽",
            ["21"] = "基尔兽",
            ["22"] = "巴达兽",
            ["23"] = "小恶魔兽",
            ["24"] = "黑加布兽",
            ["25"] = "迷幻兽",
            ["26"] = "哥布林兽",
            ["27"] = "多路兽",
            ["28"] = "V仔兽",
            ["29"] = "雪亚古兽",
            ["30"] = "黑亚古兽",
            ["31"] = "加布兽",
            ["32"] = "NO DATA",
            ["33"] = "日轮兽",
            ["34"] = "NO DATA",
            ["35"] = "甲虫兽",
            ["36"] = "比丘兽",
            ["37"] = "火焰兽",
            ["38"] = "飞龙兽",
            ["39"] = "加鲁鲁兽",
            ["40"] = "鬼怪兽",
            ["41"] = "NO DATA",
            ["42"] = "NO DATA",
            ["43"] = "巨鲸兽",
            ["44"] = "NO DATA",
            ["45"] = "黑迪路兽",
            ["46"] = "NO DATA",
            ["47"] = "大地暴龙兽",
            ["48"] = "向日葵兽",
            ["49"] = "加奥加兽",
            ["50"] = "鼻涕兽",
            ["51"] = "狮子兽",
            ["52"] = "NO DATA",
            ["53"] = "古拉兽",
            ["54"] = "天使兽",
            ["55"] = "橙古拉兽",
            ["56"] = "迪路兽",
            ["57"] = "恶魔兽",
            ["58"] = "黑古拉兽",
            ["59"] = "冰恶魔兽",
            ["60"] = "NO DATA",
            ["61"] = "黑加鲁鲁兽",
            ["62"] = "古鲁鲁兽",
            ["63"] = "卑劣兽",
            ["64"] = "NO DATA",
            ["65"] = "NO DATA",
            ["66"] = "比多兽",
            ["67"] = "鸟龙兽",
            ["68"] = "大便兽",
            ["69"] = "野菜兽",
            ["70"] = "暴龙兽",
            ["71"] = "NO DATA",
            ["72"] = "光明兽FM",
            ["73"] = "NO DATA",
            ["74"] = "门左卫兽",
            ["75"] = "跃升暴龙兽",
            ["76"] = "丁香兽",
            ["77"] = "音速加奥加兽",
            ["78"] = "NO DATA",
            ["79"] = "NO DATA",
            ["80"] = "NO DATA",
            ["81"] = "吸血魔兽",
            ["82"] = "飞虫兽",
            ["83"] = "神圣天使兽",
            ["84"] = "女恶魔兽",
            ["85"] = "百万海龙兽",
            ["86"] = "NO DATA",
            ["87"] = "大古拉兽",
            ["88"] = "黑大古拉兽",
            ["89"] = "狼人加鲁鲁兽",
            ["90"] = "天女兽",
            ["91"] = "蓝火焰兽",
            ["92"] = "黑狼人加鲁鲁兽",
            ["93"] = "NO DATA",
            ["94"] = "NO DATA",
            ["95"] = "橙大古拉兽",
            ["96"] = "NO DATA",
            ["97"] = "百万龙兽",
            ["98"] = "机械暴龙兽",
            ["99"] = "超比多兽",
            ["100"] = "迦楼罗兽",
            ["101"] = "猿猴兽",
            ["102"] = "海天使兽",
            ["103"] = "战斗暴龙兽",
            ["104"] = "莉莉丝兽",
            ["105"] = "别西卜兽",
            ["106"] = "巴尔巴兽",
            ["107"] = "利维亚兽",
            ["108"] = "魔神兽",
            ["109"] = "贝尔菲兽",
            ["110"] = "混沌兽",
            ["111"] = "暗龙兽",
            ["112"] = "番长狮子兽",
            ["113"] = "蔷薇兽",
            ["114"] = "白金鼻涕兽",
            ["115"] = "NO DATA",
            ["116"] = "奥米加兽",
            ["117"] = "闪光暴龙兽",
            ["118"] = "幻影加奥加兽",
            ["119"] = "NO DATA",
            ["120"] = "战斗暴龙兽X抗体",
            ["121"] = "公爵兽",
            ["122"] = "钢铁加鲁鲁兽",
            ["123"] = "混沌公爵兽",
            ["124"] = "黑暗战斗暴龙兽",
            ["125"] = "黑钢铁加鲁鲁兽",
            ["126"] = "NO DATA",
            ["127"] = "NO DATA",
            ["128"] = "NO DATA",
            ["129"] = "NO DATA",
            ["130"] = "NO DATA",
            ["131"] = "终弩加鲁鲁兽",
            ["132"] = "胜利暴龙兽",
            ["133"] = "NO DATA",
            ["134"] = "NO DATA",
            ["135"] = "NO DATA",
            ["136"] = "艾可萨兽",
            ["137"] = "公公兽",
            ["138"] = "力神比多兽",
            ["139"] = "凤凰兽",
            ["140"] = "金属猿猴兽",
            ["141"] = "炽天使兽",
            ["142"] = "蓝机械暴龙兽",
            ["143"] = "启示录兽",
            ["144"] = "次体",
            ["145"] = "次体",
            ["146"] = "次体",
            ["147"] = "次体",
            ["148"] = "黑战斗暴龙兽X抗体",
            ["149"] = "亚古兽",
            ["150"] = "守卫机器人兽",
            ["151"] = "安杜鲁兽",
            ["152"] = "哥玛兽",
            ["153"] = "海狮兽",
            ["154"] = "祖顿兽",
            ["155"] = "维京兽",
            ["156"] = "海龙兽",
            ["157"] = "巴鲁兽",
            ["158"] = "仙人掌兽",
            ["159"] = "艾可萨兽（BOSS用）",
            ["160"] = "门左卫兽（色异）",
            ["161"] = "蔷薇兽X抗体",
            ["162"] = "亚古兽X抗体",
            ["163"] = "暴龙兽X抗体",
            ["164"] = "海龙兽X抗体",
            ["165"] = "哥玛兽X抗体",
            ["166"] = "奥米加兽X抗体",
            ["167"] = "公爵兽X抗体",
            ["168"] = "百合兽",
            ["169"] = "世界树",
            ["170"] = "小狗兽",
            ["171"] = "小狗兽X抗体",
            ["172"] = "巨龙兽",
            ["173"] = "金属巨龙兽",
            ["174"] = "XV兽",
            ["175"] = "死X兽",
            ["176"] = "锹形虫兽",
            ["177"] = "贝壳兽",
            ["178"] = "角龙兽",
            ["179"] = "雪人兽",
            ["180"] = "毛人兽",
            ["181"] = "人马兽",
            ["182"] = "钻头鼹鼠兽",
            ["183"] = "蛋蛋兽",
            ["184"] = "什么兽",
            ["185"] = "老爷怪蛙兽",
            ["186"] = "巫师兽",
            ["187"] = "华丽兽",
            ["188"] = "树灵兽",
            ["189"] = "垃圾桶兽",
            ["190"] = "恶门左卫兽",
            ["191"] = "金甲龙兽",
            ["192"] = "红锈巨龙兽",
            ["193"] = "亚古兽",
            ["194"] = "无限龙兽",
            ["195"] = "泡泡兽",
            ["196"] = "年糕兽",
            ["197"] = "贝塔兽",
            ["198"] = "光明兽",
            ["199"] = "狐狸兽",
            ["200"] = "虫虫兽",
            ["201"] = "枯木兽",
            ["202"] = "奥加兽",
            ["203"] = "九尾兽",
            ["204"] = "多路加兽",
            ["205"] = "V龙兽",
            ["206"] = "闹钟兽",
            ["207"] = "怪蛙兽",
            ["208"] = "天翔V龙兽",
            ["209"] = "大锹形虫兽",
            ["210"] = "千兆龙兽",
            ["211"] = "格斗狮子兽",
            ["212"] = "骷髅暴龙兽",
            ["213"] = "道士兽",
            ["214"] = "死亡火焰兽",
            ["215"] = "多路暴龙兽",
            ["216"] = "叠龙兽",
            ["217"] = "白狮兽",
            ["218"] = "小妖精兽",
            ["219"] = "入侵兽",
            ["220"] = "豆豆兽",
            ["221"] = "金属豆豆兽",
            ["222"] = "鹦鹉兽",
            ["223"] = "大师巨龙兽",
            ["224"] = "阿尔法兽",
            ["225"] = "究极V龙兽",
            ["226"] = "究极V龙兽X抗体",
            ["227"] = "帝皇龙甲兽FM",
            ["228"] = "帝皇龙甲兽PM",
            ["229"] = "座天使兽",
            ["230"] = "混沌龙兽",
            ["231"] = "巨大锹形虫兽",
            ["232"] = "剑狮兽",
            ["233"] = "咲耶兽",
            ["234"] = "高等安杜鲁兽",
            ["235"] = "小丑兽",
            ["236"] = "木偶兽",
            ["237"] = "王子豆豆兽",
            ["238"] = "别西卜兽X抗体",
            ["239"] = "螺栓兽",
            ["240"] = "金甲龙兽X抗体",
            ["241"] = "钢铁加鲁鲁兽X抗体",
            ["242"] = "钢铁海龙兽",
            ["243"] = "光明兽SM",
            ["244"] = "普尼兽",
            ["245"] = "犄角兽",
            ["246"] = "贝尔菲兽SM",
            ["247"] = "泰坦兽",
            ["999"] = "NO DATA",
            ["1001"] = "繁乐西",
            ["1002"] = "明步",
            ["1003"] = "尼可",
            ["1004"] = "裕也",
            ["1005"] = "美玲",
            ["1006"] = "佩特洛夫",
            ["1007"] = "莉莉",
            ["1008"] = "塞巴斯蒂安",
            ["1009"] = "男子儿童A",
            ["1010"] = "男子儿童B",
            ["1011"] = "女子儿童A",
            ["1012"] = "女子儿童B",
            ["1013"] = "男子学生A",
            ["1014"] = "男子学生B",
            ["1015"] = "女子学生A",
            ["1016"] = "女子学生B",
            ["1017"] = "一般人男性A",
            ["1018"] = "一般人男性B",
            ["1019"] = "一般人女性A",
            ["1020"] = "一般人女性B",
            ["1021"] = "职员A",
            ["1022"] = "职员B",
            ["1023"] = "莉莉门左卫兽",
            ["1024"] = "太一",
            ["1025"] = "大和",
            ["1026"] = "武之内 空",
            ["1027"] = "大辅",
            ["1028"] = "启人",
            ["1029"] = "热情的主编",

            ["1030"] = "男子学生C",
            ["1031"] = "女子学生C",
            ["1032"] = "光子郎",
            ["1033"] = "美美",
            ["1034"] = "城户 丈",
            ["1035"] = "高石 岳",
            ["1036"] = "八神 光",
            ["1037"] = "大门 大",

            ["1053"] = "“时钟兽”",
            ["1054"] = "“黑战暴”",

            ["1055"] = "光子朗",
            ["1056"] = "美美",
            ["1057"] = "丈",
            ["1058"] = "岳",
            ["1059"] = "光",
            ["1060"] = "大门大",
            ["1062"] = "大河",
            ["1063"] = "四之宫莉娜",

            ["1011"] = "大河/莉娜",

            ["2001"] = "繁乐西的搭档",
            //["2001"] = "???",
            ["2002"] = "???",
            ["2003"] = "猫咪驯兽师",
            ["2004"] = "???",
            ["2005"] = "???",
            ["2006"] = "???",
            ["2007"] = "???",
            ["2008"] = "数码鸟灵",
            ["2009"] = "数码鸟灵",
            ["2010"] = "数码鸟灵",

            ["2011"] = "数码鸟灵",
            ["2012"] = "飒夏柯",
            ["2013"] = "飒夏柯",
            ["2014"] = "飒夏柯",
            ["2015"] = "飒夏柯",
            ["2016"] = "天女兽",

            ["2017"] = "女恶魔兽",
            ["2018"] = "小黢",
            ["2019"] = "大河",
            ["2020"] = "数码球儿",
            ["2021"] = "VV",
            ["2022"] = "VV",
            ["2023"] = "VV",
            ["2024"] = "VV",
            ["2025"] = "数码球儿",
            ["2026"] = "数码球儿",
            ["2027"] = "数码球儿",
            ["2028"] = "数码球儿",
            ["2030"] = "翔大",
            ["2031"] = "兽太郎",
            ["2032"] = "Bungie",
            ["2033"] = "码君",
            ["2034"] = "姥",
            ["2035"] = "元气",
            ["2036"] = "满天",
            ["2037"] = "龙之介",
            ["2038"] = "数码太郎",
            ["2039"] = "小翼",
            ["2040"] = "啃太郎",
            ["2041"] = "小喷",
            ["2042"] = "马之介",
            ["2043"] = "风牙",
            ["2044"] = "洛一底",
            ["2045"] = "猫丸",
            ["2046"] = "谦一",
            ["2047"] = "银河",
            ["2048"] = "乌奇",
            ["2049"] = "小荠",
            ["2050"] = "安本",
            ["2051"] = "街风",
            ["2052"] = "暗夜男爵",
            ["2053"] = "陆帕斯",
            ["2054"] = "蒙布朗",
            ["2055"] = "多铭哥",
            ["2056"] = "进果",
            ["2057"] = "加力勉君",
            ["2058"] = "卢恰诺",
            ["2059"] = "玖司塔瓦",
            ["2060"] = "阿夭英",
            ["2061"] = "拉里阿托",
            ["2062"] = "速攻的谦二",
            ["2063"] = "小易",
            ["2064"] = "那可",
            ["2065"] = "刚田",
            ["2066"] = "阳卡",
            ["2067"] = "复力司罗",
            ["2068"] = "艺特",
            ["2069"] = "维克拓尔",
            ["2070"] = "数码凯则",
            ["2071"] = "武佐司",
            ["2072"] = "一志",
            ["2073"] = "ＮＯＢＵＮＡＧＡ",
            ["2074"] = "敦加",
            ["2075"] = "天狼",
            ["2076"] = "阿贺介",
            ["2077"] = "麦科勒",
            ["2078"] = "安拓料",
            ["2079"] = "库若得",
            ["2080"] = "黑须",
            ["2081"] = "即落断",
            ["2082"] = "ＫＩＬＬＥＲ",
            ["2083"] = "未人口",
            ["2084"] = "雀搏",
            ["2085"] = "毛茶",
            ["2086"] = "那不拉",
            ["2087"] = "米课罗凡齐",
            ["2088"] = "狼仔",
            ["2089"] = "卡尔",
            ["2090"] = "耶浪",
            ["2091"] = "疾风",
            ["2092"] = "音对",
            ["2093"] = "丑巴怪",
            ["2094"] = "库洛步",
            ["2095"] = "咚当咚",
            ["2096"] = "巴巴压落",
            ["2097"] = "啊啊啊啊啊",
            ["2098"] = "米切朗杰罗",
            ["2099"] = "艾朵尬",
            ["2100"] = "砂玻璃曼",
            ["2101"] = "谦二",
            ["2102"] = "鸡大哥",
            ["2103"] = "眼镜儿",
            ["2104"] = "澪",
            ["2105"] = "立直",
            ["2106"] = "进吪",
            ["2107"] = "台君",
            ["2108"] = "罗卜特",
            ["2109"] = "星叶",
            ["2110"] = "ＯＪＩＳＡＮ",
            ["2111"] = "丹弟",
            ["2112"] = "毛毛虫大王",
            ["2113"] = "旺人",
            ["2114"] = "埴和",
            ["2115"] = "南风",
            ["2116"] = "野进",
            ["2117"] = "硬绰",
            ["2118"] = "黑尔牟坨",
            ["2119"] = "高斯",
            ["2120"] = "郁耳",
            ["2121"] = "旦啵啵",
            ["2122"] = "妮纳",
            ["2123"] = "桃桃",
            ["2124"] = "米米",
            ["2125"] = "希音梨",
            ["2126"] = "平成子",
            ["2127"] = "小蛹",
            ["2128"] = "查路路",
            ["2129"] = "库里斯塔路",
            ["2130"] = "美尹",
            ["2131"] = "磅荡达",
            ["2132"] = "新龙",
            ["2133"] = "希利希",
            ["2134"] = "马卡浓",
            ["2135"] = "嘣呵",
            ["2136"] = "鲭太郎",
            ["2137"] = "三烧",
            ["2138"] = "索泥亚",
            ["2139"] = "伊利砂白",
            ["2140"] = "巧克力",
            ["2141"] = "真美",
            ["2142"] = "甜点",
            ["2143"] = "星姬",
            ["2144"] = "刺玫果",
            ["2145"] = "米果嫩",
            ["2146"] = "欻歘儿",
            ["2147"] = "伊利渣",
            ["2148"] = "西模努",
            ["2149"] = "阿拉尼斯",
            ["2150"] = "硫硫磷",
            ["2151"] = "耀啤",
            ["2152"] = "咯哒咯咯",
            ["2153"] = "梨子",
            ["2154"] = "ＬＯＶＥ４Ｕ",
            ["2155"] = "来梦音",
            ["2156"] = "灯笼椒",
            ["2157"] = "贝呢得特",
            ["2158"] = "乐咪哩",
            ["2159"] = "名四",
            ["2160"] = "咲酱",
            ["2161"] = "小菇",
            ["2162"] = "卡农",
            ["2163"] = "弩弹",
            ["2164"] = "软果糖",
            ["2165"] = "明海",
            ["2166"] = "轻棉",
            ["2167"] = "雀奈",
            ["2168"] = "悦奈",
            ["2169"] = "纳塔下",
            ["2170"] = "比弥子",
            ["2171"] = "岸给",
            ["2172"] = "ＴＥＮＴＥＮ",
            ["2173"] = "热水袋",
            ["2174"] = "薄饼",
            ["2175"] = "恋乙女",
            ["2176"] = "黑江",
            ["2177"] = "昵可洛",
            ["2178"] = "咔啦",
            ["2179"] = "路西",
            ["2180"] = "蹦床",
            ["2181"] = "猫妖",
            ["2182"] = "色罗离努",
            ["2183"] = "小月",
            ["2184"] = "太阳花",
            ["2185"] = "亚饥",
            ["2186"] = "肉球",
            ["2187"] = "舍瓦力诺",
            ["2188"] = "马粒",
            ["2189"] = "可仑",
            ["2190"] = "町子",
            ["2191"] = "色类补",
            ["2192"] = "三三三",
            ["2193"] = "爿囧片",
            ["2194"] = "勃勃",
            ["2195"] = "欧陪拉",
            ["2196"] = "阿茶",
            ["2197"] = "枯劳帝亚",
            ["2198"] = "绘里",
            ["2199"] = "繁乐栖司",
            ["2200"] = "红牛",
            ["2201"] = "惠马",
            ["2202"] = "秃河",
            ["2203"] = "ＬＵＣＫＹ",
            ["2204"] = "肉豆叩",
            ["2205"] = "Biu帝",
            ["2206"] = "尻尾",
            ["2207"] = "库雷门屉",
            ["2208"] = "每力沙",
            ["2209"] = "眠寸",
            ["2210"] = "莉莉",
            ["2211"] = "塞巴斯蒂安",
            ["2212"] = "八神 太一",
            ["2213"] = "石田 大和",
            ["2214"] = "武之内 空",
            ["2215"] = "本宮 大辅",
            ["2216"] = "松田 启人",
            ["2217"] = "巴达力努",
            ["2218"] = "海贼黑暗暴龙兽",
            ["2219"] = "热情的主编",
            ["2220"] = "纯",
            ["2221"] = "纯次",
            ["2222"] = "GIGO公司",
            ["2223"] = "GIGO公司",
            ["2224"] = "GIGO公司",
            ["2225"] = "GIGO公司",
            ["2226"] = "GIGO公司",
            ["2227"] = "莉莉",
            ["2228"] = "莉莉",
            ["2229"] = "人偶服莉莉",
            ["2230"] = "泉 光子郎",
            ["2231"] = "太刀川 美美",
            ["2232"] = "城户 丈",
            ["2233"] = "高石 岳",
            ["2234"] = "八神 光",
            ["2235"] = "大门 大",
            ["2236"] = "",
            ["2237"] = "",
            ["2238"] = "",
            ["2239"] = "赞助",
            ["2240"] = "守卫机器人兽",
            ["2241"] = "大便兽大王",
            ["2242"] = "对战迷",
            ["2243"] = "",
            ["2244"] = "",
            ["2245"] = "",
            ["2246"] = "",
            ["2247"] = "",
            ["2248"] = "",
            ["2249"] = "",
            ["2250"] = "",
            ["2251"] = "",
            ["2252"] = "",
            ["2253"] = "",
            ["2254"] = "",
            ["2255"] = "",
            ["2256"] = "",
            ["2257"] = "",
            ["2258"] = "",
            ["2259"] = "",
            ["2260"] = "",
            ["2261"] = "",
            ["2262"] = "",
            ["2263"] = "",
            ["2264"] = "四之宫莉娜",
            ["2265"] = "四之宫莉娜坦",
            ["2266"] = "莉娜莉娜",
            ["2267"] = "莉娜姬",
            ["2268"] = "最强莉娜酱",
            ["2269"] = "",
            ["2270"] = "",
            ["2300"] = "大河",
            ["2301"] = "莉娜",
            ["2302"] = "？？？",
            ["2302"] = "？？？",
            ["2400"] = "代代",
            ["2401"] = "啃啃",
            ["2402"] = "杉子",
            ["2403"] = "嗷比",
            ["2404"] = "科科",
            ["2405"] = "咪咔",
            ["2406"] = "哗",
            ["2407"] = "喔嗒",
            ["2408"] = "小然",
            ["2409"] = "跡漠",
            ["2410"] = "马索",
            ["2411"] = "玛希捺",
            ["2412"] = "迪娃",
            ["2413"] = "达扎克",
            ["2414"] = "酷菜",
            ["2415"] = "对战迷",
            ["2416"] = "",
            ["2417"] = "",
            ["2418"] = "",
            ["2419"] = "",
            ["2420"] = "",
            ["2421"] = "",
            ["2422"] = "",
            ["2423"] = "",
            ["2424"] = "",
            ["2425"] = "",
            ["2426"] = "",
            ["2427"] = "",
            ["2428"] = "",
            ["2429"] = "",
            ["2430"] = "",
            ["2431"] = "",
            ["2432"] = "",
            ["2433"] = "",
            ["2434"] = "",
            ["3000"] = "",
            ["3001"] = "创世村",
            ["3002"] = "创世村街（南口）",
            ["3003"] = "创世村街（中央）",
            ["3004"] = "创世村街（东口）",
            ["3005"] = "创世村街（西口）",
            ["3006"] = "公公兽的家",
            ["3007"] = "物品商店",
            ["3008"] = "寄存屋",
            ["3009"] = "饭店",
            ["3010"] = "天使医院",
            ["3011"] = "特训馆",
            ["3012"] = "哆唻咪发所",
            ["3013"] = "哆唻咪发所(1F)",
            ["3014"] = "哆唻咪发所(2F)",
            ["3015"] = "哆唻咪发所(3F)",
            ["3021"] = "斗技场",
            ["3022"] = "斗技场前广場",
            ["3023"] = "斗技场(1F大厅)",
            ["3024"] = "斗技场（对战区）",
            ["3031"] = "斗技场",
            ["3032"] = "斗技场(10F大厅)",
            ["3033"] = "斗技场（10F对战区）",
            ["3034"] = "斗技场（通道）",
            ["3035"] = "斗技场（管制室）",
            ["3036"] = "次元的间隙",
            ["3037"] = "斗技场(20F大厅)",
            ["3038"] = "斗技场（20F对战区）",
            ["3039"] = "斗技场(30F大厅)",
            ["3040"] = "斗技场（30F对战区）",
            ["3041"] = "斗技场(40F大厅)",
            ["3042"] = "斗技场（40F对战区）",
            ["3043"] = "※分歧的对战用对战地图",
            ["3044"] = "斗技场（地下）",
            ["3051"] = "铁路的平原",
            ["3052"] = "铁路的平原（海岸）",
            ["3053"] = "铁路的平原（驿站）",
            ["3054"] = "铁路的平原（洞窟）",
            ["3055"] = "铁路的平原（大草原）",
            ["3056"] = "铁路的平原（村周边）",
            ["3057"] = "铁路的平原",
            ["3058"] = "火车停驻场",
            ["3059"] = "电车内部",
            ["3061"] = "道标森林",
            ["3062"] = "道标森林（海岸）",
            ["3063"] = "道标森林（西北）",
            ["3064"] = "道标森林（森林中心）",
            ["3065"] = "道标森林（沼地）",
            ["3066"] = "道标森林（村尽头）",
            ["3067"] = "道标森林",
            ["3068"] = "",
            ["3071"] = "水淹的古都",
            ["3072"] = "水淹的古都（草原）",
            ["3073"] = "水淹的古都（岩壁）",
            ["3074"] = "水淹的古都（波间中央）",
            ["3075"] = "水淹的古都（森林）",
            ["3076"] = "水淹的古都(大海)",
            ["3077"] = "水淹的古都",
            ["3078"] = "鲸鱼兽码头",
            ["3081"] = "古代骨沼泽",
            ["3082"] = "古代骨沼泽（森林）",
            ["3083"] = "古代骨沼泽（骨巢）",
            ["3084"] = "古代骨沼泽（沼泽中心）",
            ["3085"] = "古代骨沼泽（龙之胃袋）",
            ["3086"] = "古代骨沼泽（龙之肋骨）",
            ["3087"] = "古代骨沼泽（峡谷）",
            ["3088"] = "古代骨沼泽（水路）",
            ["3089"] = "ジュレイダケ展望台",
            ["3090"] = "古代骨の沼（巨鳥の巣）",
            ["3091"] = "地下水路迷宫",
            ["3092"] = "地下水路迷宫（森）",
            ["3093"] = "地下水路迷宫（中央西）",
            ["3094"] = "地下水路迷宫（沼）",
            ["3095"] = "地下水路迷宫（中央）",
            ["3096"] = "大锅厅堂",
            ["3097"] = "地下水路迷宫",
            ["3101"] = "荧光洞窟",
            ["3102"] = "荧光洞窟（草原）",
            ["3103"] = "荧光洞窟（青苔）",
            ["3104"] = "荧光洞窟（黄苔）",
            ["3105"] = "荧光洞窟（中央三色）",
            ["3106"] = "荧光洞窟（沙漠）",
            ["3107"] = "荧光洞窟（往深处道）",
            ["3108"] = "荧光洞窟（馆）",
            ["3111"] = "夜市峡谷",
            ["3112"] = "夜市峡谷（沼）",
            ["3113"] = "夜市峡谷（南）",
            ["3114"] = "夜市峡谷（中腹）",
            ["3115"] = "夜市峡谷（雪山）",
            ["3116"] = "夜市峡谷（垃圾舍弃场）",
            ["3117"] = "夜市峡谷",
            ["3118"] = "钻头隧道",
            ["3119"] = "时钟塔",
            ["3121"] = "雪粉悬崖",
            ["3122"] = "雪粉悬崖（峡谷）",
            ["3123"] = "雪粉悬崖（结冰）",
            ["3124"] = "雪粉悬崖（裂隙）",
            ["3125"] = "雪粉悬崖（结晶通路）",
            ["3126"] = "雪粉悬崖",
            ["3127"] = "雪粉悬崖（光辉谷）",
            ["3128"] = "沉没冰海的油船",
            ["3131"] = "沙砾荒野",
            ["3132"] = "沙砾荒野（西南）",
            ["3133"] = "沙砾荒野（西北）",
            ["3134"] = "沙砾荒野（沙漠中央）",
            ["3135"] = "沙砾荒野（东北）",
            ["3136"] = "沙砾荒野（东南）",
            ["3137"] = "沙砾荒野",
            ["3141"] = "盆景火山",
            ["3142"] = "盆景火山（2号炉）",
            ["3143"] = "盆景火山（2号炉）",
            ["3144"] = "盆景火山（1号炉）",
            ["3145"] = "盆景火山（北洞窟）",
            ["3146"] = "盆景（南洞窟）",
            ["3147"] = "盆景火山",
            ["3148"] = "盆景火山（通道）",
            ["3151"] = "二进制城堡",
            ["3152"] = "二进制城堡(相角1)",
            ["3153"] = "二进制城堡(相角2)",
            ["3154"] = "二进制城堡(相角3)",
            ["3155"] = "二进制城堡(相角4)",
            ["3156"] = "二进制城堡",
            ["3157"] = "",
            ["3158"] = "",
            ["3159"] = "ＮＯ　ＤＡＴＡ",
            ["3160"] = "鸟龙运业",
            ["3161"] = "卡店",
            ["3162"] = "集卡者",
            ["3163"] = "探宝屋",
            ["3164"] = "占卜屋",
            ["3165"] = "",
            ["3166"] = "",
            ["3167"] = "",
            ["3168"] = "",
            ["3169"] = "",
            ["3170"] = "",
            ["3171"] = "无限山",
            ["3172"] = "无限山・入口",
            ["3173"] = "无限山・深渊",
            ["3174"] = "无限山 000-00",
            ["3175"] = "无限山 000-??",
            ["3176"] = "？？？",
            ["3177"] = "",
            ["3178"] = "",
            ["3179"] = "",
            ["3180"] = "数码之塔",
            ["3181"] = "数码之塔(50F)",
            ["3182"] = "数码之塔(60F)",
            ["3183"] = "数码之塔",
            ["3184"] = "数码之塔(70F)",
            ["3185"] = "数码之塔(80F)",
            ["3186"] = "数码之塔(90F)",
            ["3187"] = "数码之塔(顶上)",
            ["3188"] = "黑暗区域",
            ["3189"] = "黑暗区域(黑暗的地平面)",
            ["3190"] = "黑暗区域(怠惰的寝床)",
            ["3191"] = "黑暗区域(嫉妬的屹立)",
            ["3192"] = "电车内部",
            ["3193"] = "天间",
            ["3194"] = "天空斗技场",
            ["3195"] = "数码塔(独房)",
            ["3196"] = "",
            ["3197"] = "",
            ["3198"] = "",
            ["3199"] = "",
            ["3200"] = "无限山 1F",
            ["3201"] = "无限山 2F",
            ["3202"] = "无限山 3F",
            ["3203"] = "无限山 4F",
            ["3204"] = "无限山 5F",
            ["3205"] = "无限山 6F",
            ["3206"] = "无限山 7F",
            ["3207"] = "无限山 8F",
            ["3208"] = "无限山 9F",
            ["3209"] = "无限山 10F",
            ["3210"] = "无限山 11F",
            ["3211"] = "无限山 12F",
            ["3212"] = "无限山 13F",
            ["3213"] = "无限山 14F",
            ["3214"] = "无限山 15F",
            ["3215"] = "无限山 16F",
            ["3216"] = "无限山 17F",
            ["3217"] = "无限山 18F",
            ["3218"] = "无限山 19F",
            ["3219"] = "无限山 20F",
            ["3220"] = "无限山 21F",
            ["3221"] = "无限山 22F",
            ["3222"] = "无限山 23F",
            ["3223"] = "无限山 24F",
            ["3224"] = "无限山 25F",
            ["3225"] = "无限山 26F",
            ["3226"] = "无限山 27F",
            ["3227"] = "无限山 28F",
            ["3228"] = "无限山 29F",
            ["3229"] = "无限山 30F",
            ["3230"] = "无限山 31F",
            ["3231"] = "无限山 32F",
            ["3232"] = "无限山 33F",
            ["3233"] = "无限山 34F",
            ["3234"] = "无限山 35F",
            ["3235"] = "无限山 36F",
            ["3236"] = "无限山 37F",
            ["3237"] = "无限山 38F",
            ["3238"] = "无限山 39F",
            ["3239"] = "无限山 40F",
            ["3240"] = "无限山 41F",
            ["3241"] = "无限山 42F",
            ["3242"] = "无限山 43F",
            ["3243"] = "无限山 44F",
            ["3244"] = "无限山 45F",
            ["3245"] = "无限山 46F",
            ["3246"] = "无限山 47F",
            ["3247"] = "无限山 48F",
            ["3248"] = "无限山 49F",
            ["3249"] = "无限山 50F",
            ["3250"] = "无限山 51F",
            ["3251"] = "无限山 52F",
            ["3252"] = "无限山 53F",
            ["3253"] = "无限山 54F",
            ["3254"] = "无限山 55F",
            ["3255"] = "无限山 56F",
            ["3256"] = "无限山 57F",
            ["3257"] = "无限山 58F",
            ["3258"] = "无限山 59F",
            ["3259"] = "无限山 60F",
            ["3260"] = "无限山 61F",
            ["3261"] = "无限山 62F",
            ["3262"] = "无限山 63F",
            ["3263"] = "无限山 64F",
            ["3264"] = "无限山 65F",
            ["3265"] = "无限山 66F",
            ["3266"] = "无限山 67F",
            ["3267"] = "无限山 68F",
            ["3268"] = "无限山 69F",
            ["3269"] = "无限山 70F",
            ["3270"] = "无限山 71F",
            ["3271"] = "无限山 72F",
            ["3272"] = "无限山 73F",
            ["3273"] = "无限山 74F",
            ["3274"] = "无限山 75F",
            ["3275"] = "无限山 76F",
            ["3276"] = "无限山 77F",
            ["3277"] = "无限山 78F",
            ["3278"] = "无限山 79F",
            ["3279"] = "无限山 80F",
            ["3280"] = "无限山 81F",
            ["3281"] = "无限山 82F",
            ["3282"] = "无限山 83F",
            ["3283"] = "无限山 84F",
            ["3284"] = "无限山 85F",
            ["3285"] = "无限山 86F",
            ["3286"] = "无限山 87F",
            ["3287"] = "无限山 88F",
            ["3288"] = "无限山 89F",
            ["3289"] = "无限山 90F",
            ["3290"] = "无限山 91F",
            ["3291"] = "无限山 92F",
            ["3292"] = "无限山 93F",
            ["3293"] = "无限山 94F",
            ["3294"] = "无限山 95F",
            ["3295"] = "无限山 96F",
            ["3296"] = "无限山 97F",
            ["3297"] = "无限山 98F",
            ["3298"] = "无限山 99F",
            ["3299"] = "无限山 100F",
            ["4000"] = "",
            ["4001"] = "圆木头粉碎击",
            ["4002"] = "在此STOP",
            ["4003"] = "拳击守卫",
            ["4004"] = "爆弹回避",
            ["4005"] = "立体画鬼脚",
            ["4006"] = "相同的是哪个",
            ["4007"] = "",
            ["4008"] = "",
            ["4009"] = "",
            ["4100"] = "文件岛",
            ["4101"] = "数码兽竞争场",
            ["4102"] = "数码世界",
            ["4103"] = "现实世界",
            ["4104"] = "福音构造体",
            ["4105"] = "",
            ["4200"] = "炒绿蘑菇",
            ["4201"] = "炙烧炒饭",
            ["4202"] = "红热虾锅",
            ["4203"] = "爆炎麻婆豆腐",
            ["4204"] = "熔岩风爆热拉面",
            ["4205"] = "火焰满汉全席",
            ["4206"] = "粉色森林色拉",
            ["4207"] = "荧光发光咖喱",
            ["4208"] = "黄色蛋烘糕",
            ["4209"] = "蓝洞窟风意大利面",
            ["4210"] = "古云芒藤",
            ["4211"] = "紫式部风流鸡蛋卷",
            ["4212"] = "悬崖糖果",
            ["4213"] = "割雪花丼",
            ["4214"] = "发怒辣椒味噌",
            ["4215"] = "冰镇关东煮",
            ["4216"] = "绝品生数码卷",
            ["4217"] = "绝对零度刨冰",
            ["4218"] = "恋爱鸡蛋烧",
            ["4219"] = "幻之带骨牛排",
            ["4220"] = "暴君龙荞麦面",
            ["4221"] = "巨龙披萨",
            ["4222"] = "未确认飞行汤",
            ["4223"] = "文件岛西式全餐",
            ["4224"] = "草原的炖菜",
            ["4225"] = "拉拉拉面",
            ["4226"] = "数码鲋鱼烧",
            ["4227"] = "数码鲜鱼刺身套餐",
            ["4228"] = "海饺子",
            ["4229"] = "深海数码咖喱",
            ["4230"] = "夜光草天妇罗",
            ["4231"] = "荞麦乌冬拉面",
            ["4232"] = "フェアリー可丽饼",
            ["4233"] = "舍华数码丸子",
            ["4234"] = "洒落ＤＯＮ",
            ["4235"] = "数码之马卡龙",
            ["4236"] = "超电磁刨冰",
            ["4237"] = "千兆吨汉堡",
            ["4238"] = "固态色拉",
            ["4239"] = "危险诋毁",
            ["4240"] = "闪金牛蒡",
            ["4241"] = "钢铁味增汁",
            ["4242"] = "霉味芝士盛",
            ["4243"] = "曲奇鼠",
            ["4244"] = "卟叮卟叮布丁",
            ["4245"] = "黄金咖喱",
            ["4246"] = "闪光玉米卷",
            ["4247"] = "乱堆烙软饼",
            ["4248"] = "恶恶炸薯饼",
            ["4249"] = "暗附盖浇饭",
            ["4250"] = "血腥意面",
            ["4251"] = "夜色西式全宴",
            ["4252"] = "牛羊角面包",
            ["4253"] = "Lady甜点",
            ["4254"] = "",
            ["4255"] = "",
            ["4256"] = "",
            ["4300"] = "",
            ["4301"] = "Ｂｉｔ",
            ["4302"] = "ＭＢ",
            ["4310"] = "解码等级",
            ["4320"] = "赏",
            ["4500"] = "数码蛋",
            ["4501"] = "幼年期1",
            ["4502"] = "幼年期2",
            ["4503"] = "成长期",
            ["4504"] = "成熟期",
            ["4505"] = "完全体",
            ["4506"] = "究极体",
            ["4510"] = "无",
            ["4511"] = "数据",
            ["4512"] = "疫苗",
            ["4513"] = "病毒",
            ["4514"] = "自由",
            ["4520"] = "无",
            ["4521"] = "火炎",
            ["4522"] = "水冰",
            ["4523"] = "大气",
            ["4524"] = "自然",
            ["4525"] = "格斗",
            ["4526"] = "光明",
            ["4527"] = "黑暗",
            ["4528"] = "机械",
            ["4529"] = "汚物",
            ["4530"] = "无",
            ["4900"] = "阿尔法兽",
            ["4901"] = "奥米加兽Ｘ",
            ["4902"] = "公爵兽Ｘ",
            ["4903"] = "无限龙兽",
            ["4904"] = "VV",
            ["4905"] = "飒夏柯",
            ["4906"] = "数码鸟灵",
            ["4907"] = "小黢",
            ["4908"] = "座天使兽",
            ["4909"] = "莉莉丝兽",

            ["501"] = "火焰呼吸",
            ["502"] = "火焰之塔",
            ["503"] = "火墙",
            ["504"] = "主",
            ["505"] = "广幅炸弹",
            ["506"] = "岩浆炸弹",
            ["507"] = "火焰风暴",
            ["508"] = "泡泡呼吸",
            ["509"] = "冰雹",
            ["5010"] = "溅水",
            ["5011"] = "水墙",
            ["5012"] = "大雨",
            ["5013"] = "冰雕",
            ["5014"] = "极光冰冻",
            ["5015"] = "电光发射",
            ["5016"] = "风鞋子",
            ["5017"] = "风切割器",
            ["5018"] = "电云",
            ["5019"] = "雷电风暴",
            ["5020"] = "迷惑风暴",
            ["5021"] = "飓风",
            ["5022"] = "毒粉",
            ["5023"] = "冰衣",
            ["5024"] = "毒圈",
            ["5025"] = "起源绑定",
            ["5026"] = "羊乳干酪",
            ["5027"] = "塌方",
            ["5028"] = "剧毒风暴",
            ["5029"] = "马赫刺拳",
            ["5030"] = "肌肉充能",
            ["5031"] = "回旋攻击",
            ["5032"] = "沉重打击",
            ["5033"] = "战斗口号",
            ["5034"] = "蓄力攻击",
            ["5035"] = "战斗气息",
            ["5036"] = "黑暗精神",
            ["5037"] = "光明灵魂",
            ["5038"] = "根源云",
            ["5039"] = "闪光",
            ["5040"] = "邪恶狂风",
            ["5041"] = "神圣光芒",
            ["5042"] = "审判",
            ["5043"] = "机械爪",
            ["5044"] = "提升级别",
            ["5045"] = "能量球",
            ["5046"] = "反攻击领域",
            ["5047"] = "极大镭射",
            ["5048"] = "机器墙",
            ["5049"] = "DG维度V2",
            ["5050"] = "脏踢",
            ["5051"] = "超恶臭喷射",
            ["5052"] = "便便陷阱",
            ["5053"] = "便便屏障",
            ["5054"] = "便便乱投",
            ["5055"] = "便便墙",
            ["5056"] = "究极便便地狱绘图",
            ["5057"] = "泡泡",
            ["5058"] = "必杀技还击",
            ["5059"] = "数据网",
            ["5060"] = "访问搬禁",
            ["5061"] = "有损压缩",

            ["7000"] = "无",
            ["7001"] = "回复磁盘",
            ["7002"] = "中回复磁盘",
            ["7003"] = "大回复磁盘",
            ["7004"] = "超回复磁盘",
            ["7005"] = "能量磁盘",
            ["7006"] = "中能量磁盘",
            ["7007"] = "大能量磁盘",
            ["7008"] = "双倍磁盘",
            ["7009"] = "治疗磁盘",
            ["7010"] = "万能磁盘",
            ["7011"] = "对变化磁盘",
            ["7012"] = "再生磁盘",
            ["7013"] = "超再生磁盘",
            ["7014"] = "创口贴",
            ["7015"] = "创口贴ＤＸ",
            ["7016"] = "攻击插件",
            ["7017"] = "防御插件",
            ["7018"] = "高速插件",
            ["7019"] = "万能插件",
            ["7020"] = "攻击插件S",
            ["7021"] = "防御插件S",
            ["7022"] = "高速插件S",
            ["7023"] = "迅速返航",
            ["7024"] = "攻击芯片",
            ["7025"] = "防御芯片",
            ["7026"] = "智力芯片",
            ["7027"] = "敏捷芯片",
            ["7028"] = "生命芯片",
            ["7029"] = "能量芯片",
            ["7030"] = "恶魔芯片A",
            ["7031"] = "恶魔芯片D",
            ["7032"] = "恶魔芯片E",
            ["7033"] = "便携卫生间",
            ["7034"] = "训练指南",
            ["7035"] = "安眠枕",
            ["7036"] = "避敌护符",
            ["7037"] = "聚敌信标",
            ["7038"] = "健康草鞋",
            ["7039"] = "肉串",
            ["7040"] = "大肉串",
            ["7041"] = "极品肉串",
            ["7042"] = "挑战人参",
            ["7043"] = "鸟萝卜",
            ["7044"] = "荠荠草",
            ["7045"] = "数码菇",
            ["7046"] = "寒冰菇",
            ["7047"] = "豪华菇",
            ["7048"] = "数码橡果",
            ["7049"] = "蓝光苹果",
            ["7050"] = "超电磁柠檬",
            ["7051"] = "黄金橡果",
            ["7052"] = "大莓子",
            ["7053"] = "甜栗子",
            ["7054"] = "兽茄",
            ["7055"] = "刺梨",
            ["7056"] = "橙蕉",
            ["7057"] = "强力草的种子",
            ["7058"] = "坚韧草的种子",
            ["7059"] = "迅疾草的种子",
            ["7060"] = "卓识草的种子",
            ["7061"] = "勃旺草的种子",
            ["7062"] = "平静草的种子",
            ["7063"] = "数码鲷鱼",
            ["7064"] = "数码鲋鱼",
            ["7065"] = "数码鳟鱼",
            ["7066"] = "数码黑鳟",
            ["7067"] = "数码鲶鱼",
            ["7068"] = "数码乌鳢",
            ["7069"] = "数码鳉鱼",
            ["7070"] = "数码鲫鱼",
            ["7071"] = "数码鲤鱼",
            ["7072"] = "数码黑鲤",
            ["7073"] = "数码鳑鲏",
            ["7074"] = "数码鲑鱼",
            ["7075"] = "数码鳅鱼",
            ["7076"] = "数码鳗鱼",
            ["7077"] = "数码鱼",
            ["7078"] = "数码",
            ["7079"] = "霉肉",
            ["7080"] = "幸运菇",
            ["7081"] = "链瓜",
            ["7082"] = "未使用的物品",
            ["7083"] = "未使用的物品",
            ["7084"] = "大海星",
            ["7085"] = "小海星",
            ["7086"] = "锐利的海星",
            ["7087"] = "圆润的海星",
            ["7088"] = "光滑的海星",
            ["7089"] = "粗糙的海星",
            ["7090"] = "巨大的矿石",
            ["7091"] = "普通的石子",
            ["7092"] = "绿数码菇",
            ["7093"] = "很脏的东西",
            ["7094"] = "RE磁盘",
            ["7095"] = "未使用的物品",
            ["7096"] = "未使用的物品",
            ["7097"] = "未使用的物品",
            ["7098"] = "未使用的物品",
            ["7099"] = "未使用的物品",
            ["7100"] = "巨大的爪",
            ["7101"] = "炎之碎片",
            ["7102"] = "烈焰之翼",
            ["7103"] = "黑夜之翼",
            ["7104"] = "正义鬃毛",
            ["7105"] = "雪白翅膀",
            ["7106"] = "幻兽之翼",
            ["7107"] = "钢铁盔甲",
            ["7108"] = "海蛇的血",
            ["7109"] = "贵重的鬃皮",
            ["7110"] = "凶暴角胄",
            ["7111"] = "太阳之种",
            ["7112"] = "兽爪套",
            ["7113"] = "深红病毒",
            ["7114"] = "神圣蓼",
            ["7115"] = "铁壁铠甲",
            ["7116"] = "贵重的角胄",
            ["7117"] = "金属部件",
            ["7118"] = "试验型部件",
            ["7119"] = "暗黑龙的坏腕",
            ["7120"] = "有爱布偶",
            ["7121"] = "王者香蕉",
            ["7122"] = "金黄色的圣翼",
            ["7123"] = "黄金的甲冑",
            ["7124"] = "雷刃角胄",
            ["7125"] = "金属香蕉",
            ["7126"] = "圣魔翼",
            ["7127"] = "巨大的左轮",
            ["7128"] = "丁香籽",
            ["7129"] = "爆速拳",
            ["7130"] = "夜中的邀请函",
            ["7131"] = "大银翼",
            ["7132"] = "贵妇的黑翼",
            ["7133"] = "巨大的双刃",
            ["7134"] = "贵重的手掌",
            ["7135"] = "圣弓",
            ["7136"] = "苍蓝烈焰",
            ["7137"] = "王者角胄",
            ["7138"] = "长空之翼",
            ["7139"] = "海兽的角胄",
            ["7140"] = "天使圣水",
            ["7141"] = "勇气之证",
            ["7142"] = "妖艳的簪子",
            ["7143"] = "地狱拳铳",
            ["7144"] = "混沌之魂",
            ["7145"] = "暗物质",
            ["7146"] = "正义制服",
            ["7147"] = "爱与美的宝玉",
            ["7148"] = "圣骑士之证",
            ["7149"] = "阳之大翼",
            ["7150"] = "满月之爪",
            ["7151"] = "勇气的Ｘ抗体",
            ["7152"] = "完美的圣枪",
            ["7153"] = "金属冰",
            ["7154"] = "巨兽砲",
            ["7155"] = "巨大的破碎剑",
            ["7156"] = "龙帝的巨梭",
            ["7157"] = "黄金天翼",
            ["7158"] = "冻土皮毛",
            ["7159"] = "谜之数码核",
            ["7160"] = "数码离子水",
            ["7161"] = "刚体插件",
            ["7162"] = "強化ＲＥ磁盘",
            ["7163"] = "必杀磁盘",
            ["7164"] = "镇静磁盘",
            ["7165"] = "暴走插件",
            ["7166"] = "神速插件",
            ["7167"] = "肉饵",
            ["7168"] = "大肉饵",
            ["7169"] = "极品肉饵",
            ["7170"] = "未使用物品",
            ["7171"] = "未使用物品",
            ["7172"] = "列车可乐",
            ["7173"] = "林荫残照红茶",
            ["7174"] = "古都茶",
            ["7175"] = "古代咖啡",
            ["7176"] = "暗打茶",
            ["7177"] = "稽古乌龙茶",
            ["7178"] = "氖光虹耀",
            ["7179"] = "数码碳酸水",
            ["7180"] = "乎乎茶",
            ["7181"] = "冷冻果汁",
            ["7182"] = "文件苏打",
            ["7183"] = "无限矿泉水",
            ["7184"] = "数码乌鲗",
            ["7185"] = "数码鲔鱼",
            ["7186"] = "数码蟹",
            ["7187"] = "数码鲸",
            ["7188"] = "小王数码鲷鱼",
            ["7189"] = "普王数码鲋鱼",
            ["7190"] = "卵王数码鳟鱼",
            ["7191"] = "黑王Ｂ数码鳟鱼",
            ["7192"] = "震王数码鲶鱼",
            ["7193"] = "鱼神数码乌鳢",
            ["7194"] = "数码鳉鱼王子",
            ["7195"] = "金王数码鲫鱼",
            ["7196"] = "大王数码鲤鱼",
            ["7197"] = "强王数码黑鲤",
            ["7198"] = "珍王数码鳑鲏",
            ["7199"] = "寒王数码鲑鱼",
            ["7200"] = "髭王数码鳅鱼",
            ["7201"] = "旨王数码鳗鱼",
            ["7202"] = "龙王鱼",
            ["7203"] = "暴王数码",
            ["7204"] = "数码大王乌鲗",
            ["7205"] = "坏王数码鲔鱼",
            ["7206"] = "数码蟹王",
            ["7207"] = "巨神数码鲸",
            ["7208"] = "未使用的物品",
            ["7209"] = "仙人掌拳套",
            ["7210"] = "妖精叶翼",
            ["7211"] = "爪化石",
            ["7212"] = "黢黑金属",
            ["7213"] = "生锈的电磁砲",
            ["7214"] = "未使用的物品",
            ["7215"] = "未使用的物品",
            ["7216"] = "真红的Ｘ抗体",
            ["7217"] = "终局的Ｘ抗体",
            ["7218"] = "至高的Ｘ抗体",
            ["7219"] = "十分熟的肉串",
            ["7220"] = "未使用的物品",
            ["7221"] = "未使用的物品",
            ["7222"] = "未使用的物品",
            ["7223"] = "刚勇的龙翼",
            ["7224"] = "奇迹的黄金铠",
            ["7225"] = "雪球",
            ["7226"] = "哆唻咪发所的垃圾",
            ["7227"] = "回复软盘",
            ["7228"] = "中回复软盘",
            ["7229"] = "大回复软盘",
            ["7230"] = "超回复软盘",
            ["7231"] = "能量软盘",
            ["7232"] = "中能量软盘",
            ["7233"] = "大能量软盘",
            ["7234"] = "双倍软盘",
            ["7235"] = "治疗软盘",
            ["7236"] = "ＲＥ软盘",
            ["7237"] = "万能软盘",
            ["7238"] = "对变化软盘",
            ["7239"] = "再生软盘",
            ["7240"] = "超再生软盘",
            ["7241"] = "绷带",
            ["7242"] = "无限绷带",
            ["7243"] = "攻击记忆体",
            ["7244"] = "防御记忆体",
            ["7245"] = "高速记忆体",
            ["7246"] = "万能记忆体",
            ["7247"] = "攻击记忆体Ｓ",
            ["7248"] = "防御记忆体Ｓ",
            ["7249"] = "高速记忆体Ｓ",
            ["7250"] = "传送卫生间",
            ["7251"] = "无限返航",
            ["7252"] = "３次元的种子",
            ["7253"] = "６次元的种子",
            ["7254"] = "１２次元的种子",
            ["7255"] = "２４次元的种子",
            ["7256"] = "兆肉节",
            ["7257"] = "吉肉节",
            ["7258"] = "太肉节",
            ["7259"] = "无限蘑菇",
            ["7260"] = "强化ＲＥ软盘",
            ["7261"] = "必杀软盘",
            ["7262"] = "镇静软盘",
            ["7263"] = "暴走记忆体",
            ["7264"] = "神速记忆体",
            ["7265"] = "刚体记忆体",
            ["7266"] = "荸荸草",
            ["7267"] = "未使用的物品",
            ["7268"] = "未使用的物品",
            ["7269"] = "未使用的物品",
            ["7270"] = "未使用的物品",
            ["7271"] = "未使用的物品",
            ["7272"] = "真红的碴",
            ["7273"] = "勇气的碴",
            ["7274"] = "终局的碴",
            ["7275"] = "至高的碴",
            ["7276"] = "未使用的物品",
            ["7277"] = "无限鲷鱼",
            ["7278"] = "无限鲋鱼",
            ["7279"] = "无限鳟鱼",
            ["7280"] = "无限鲶鱼",
            ["7281"] = "无限乌鳢",
            ["7282"] = "无限鳉鱼",
            ["7283"] = "无限鲫鱼",
            ["7284"] = "无限鲤鱼",
            ["7285"] = "无限黑鲤",
            ["7286"] = "无限鳑鲏",
            ["7287"] = "无限鲑鱼",
            ["7288"] = "无限鳅鱼",
            ["7289"] = "无限鳗鱼",
            ["7290"] = "无限鱼",
            ["7291"] = "无限",
            ["7292"] = "无限乌鲗",
            ["7293"] = "无限鲔鱼",
            ["7294"] = "无限蟹",
            ["7295"] = "无限鲸",
            ["7296"] = "小王无限鲷鱼",
            ["7297"] = "普王无限鲋鱼",
            ["7298"] = "卵王无限鳟鱼",
            ["7299"] = "震王无限鲶鱼",
            ["7300"] = "鱼神无限乌鳢",
            ["7301"] = "无限鳉鱼王子",
            ["7302"] = "金王无限鲫鱼",
            ["7303"] = "大王无限鲤鱼",
            ["7304"] = "强王无限黑鲤",
            ["7305"] = "珍王无限鳑鲏",
            ["7306"] = "寒王无限鲑鱼",
            ["7307"] = "髭王无限鳅鱼",
            ["7308"] = "旨王无限鳗鱼",
            ["7309"] = "龙王无限鱼",
            ["7310"] = "暴王无限",
            ["7311"] = "无限大王乌鲗",
            ["7312"] = "坏王无限鲔鱼",
            ["7313"] = "无限蟹王",
            ["7314"] = "巨神无限鲸",
            ["7315"] = "鬼骨棒",
            ["7316"] = "妖狐的铃纽",
            ["7317"] = "Ｖ驯兽师之证",
            ["7318"] = "虫人的暗杀书",
            ["7319"] = "质子金属",
            ["7320"] = "巨大剪刀",
            ["7321"] = "食虫植物的肥料",
            ["7322"] = "大木枯枝",
            ["7323"] = "半兽半人的铁头盔",
            ["7324"] = "被诅咒的破布",
            ["7325"] = "炸弹拳套",
            ["7326"] = "金属装甲Ｓ",
            ["7327"] = "咒术灵符",
            ["7328"] = "古代种的双魂",
            ["7329"] = "翼龙的刃角",
            ["7330"] = "血渍金属",
            ["7331"] = "不详的剪刀",
            ["7332"] = "暗黑的骨块",
            ["7333"] = "林海的巨大木",
            ["7334"] = "黢黑手掌",
            ["7335"] = "妖精的矛枪",
            ["7336"] = "谜之镭射枪",
            ["7337"] = "暗黑的蛋",
            ["7338"] = "破坏性狱炎",
            ["7339"] = "高速涡轮",
            ["7340"] = "高贵的鬃毛",
            ["7341"] = "邪恶布偶",
            ["7342"] = "王家的伪证",
            ["7343"] = "巫女的锡杖",
            ["7344"] = "皇帝龙古砲",
            ["7345"] = "奥米加之剑",
            ["7346"] = "漆黑的魔法阵",
            ["7347"] = "神速的苍铠",
            ["7348"] = "恶魔的剪子",
            ["7349"] = "无限金属",
            ["7350"] = "ＣＨＯ－合金",
            ["7351"] = "小丑的假面",
            ["7352"] = "诅咒木偶",
            ["7353"] = "完成型部件",
            ["7354"] = "强欲的老髭",
            ["7355"] = "圣母的投枪",
            ["7356"] = "悲凄的战斧",
            ["7357"] = "古狮子大牙",
            ["7358"] = "极彩色铂金",
            ["7359"] = "深红金属",
            ["7360"] = "神速的Ｘ抗体",
            ["7361"] = "暴食的Ｘ抗体",
            ["7362"] = "奇迹的Ｘ抗体",
            ["7363"] = "未使用的物品",
            ["7364"] = "Ｘ缓和区场",
            ["7365"] = "垃圾数据渣",
            ["7366"] = "鬼神的怨骨刃",
            ["7367"] = "雀马狸的柴",
            ["7368"] = "勇气芯片",
            ["7369"] = "友情芯片",
            ["7370"] = "爱情芯片",
            ["7371"] = "知识芯片",
            ["7372"] = "纯真芯片",
            ["7373"] = "诚实芯片",
            ["7374"] = "希望芯片",
            ["7375"] = "光明芯片",
            ["7376"] = "Ｖ芯片",
            ["7377"] = "蓝色芯片",
            ["7378"] = "番长芯片",
            ["7379"] = "便利指南",
            ["7380"] = "奇迹的碴",
            ["7381"] = "神速的碴",
            ["7382"] = "暴食的碴",
            ["7383"] = "漆黑的Ｘ抗体",
            ["7384"] = "半完全部件",
            ["7385"] = "爆破代码",
            ["7386"] = "屏蔽代码",
            ["7387"] = "提速代码",
            ["7388"] = "智脑代码",
            ["7389"] = "技术代码",
            ["7390"] = "老蛇的鳞片",
            ["7391"] = "幼生解码器",
            ["7392"] = "空白的电脑核",
            ["7393"] = "破坏的意志",
            ["7394"] = "守护的意志",
            ["7395"] = "神速的意志",
            ["7396"] = "贤者的意志",
            ["7397"] = "技能的意志",
            ["7398"] = "DUMMY1",
            ["7399"] = "DUMMY2",
            ["7400"] = "电玩通助推器",
            ["7401"] = "电玩通ＵＳＢ",
            ["7402"] = "电玩通牛排",
            ["7403"] = "电玩通高级鱼",
            ["7404"] = "满足肉",
            ["7405"] = "气合肉",
            ["7406"] = "优惠磁盘",
            ["7407"] = "三倍磁盘",
            ["7408"] = "逆袭磁盘",
            ["7409"] = "拟可力饮料",
            ["7410"] = "修行饮料",
            ["7411"] = "失彩蘑菇",
            ["7412"] = "长老蘑菇",
            ["7413"] = "究极辅助",
            ["7414"] = "植婉婉",
            ["7415"] = "铂金橡果",
            ["7416"] = "超电击柠檬",
            ["7417"] = "哈喇栗子",
            ["7418"] = "攻防插件",
            ["7419"] = "ＭＡＸ插件",
            ["7420"] = "数码电击鲇",
            ["7421"] = "白海神数码鲸",
            ["7422"] = "奋斗芯片",
            ["7423"] = "干劲芯片"
        };
    }
}
